[
  {
    "id": "workbench.action.lockEditorGroup",
    "desc": "Locks the current editor group to prevent it from being reused for opening other files."
  },
  {
    "id": "workbench.action.unlockEditorGroup",
    "desc": "Unlocks the currently selected editor group, allowing for the movement and resizing of the editor within the window."
  },
  {
    "commandId": "editor.fold",
    "desc": "Folds (collapses) the innermost uncollapsed region at the cursor location in the editor."
  },
  {
    "commandId": "editor.foldRecursively",
    "desc": "Folds the code block at the current cursor position and all the inner blocks recursively."
  },
  {
    "commandId": "editor.foldAll",
    "desc": "Collapses all foldable regions in the editor."
  },
  {
    "commandId": "editor.unfoldAll",
    "desc": "Unfolds all regions in the editor, expanding all hidden text."
  },
  {
    "commandId": "editor.foldAllBlockComments",
    "desc": "Folds all block comment regions in the editor."
  },
  {
    "commandId": "editor.foldAllMarkerRegions",
    "desc": "Folds all regions in the editor that have been marked with folding markers."
  },
  {
    "commandId": "editor.unfoldAllMarkerRegions",
    "desc": "Unfolds all regions in the editor that have been folded by markers."
  },
  {
    "commandId": "editor.createFoldingRangeFromSelection",
    "desc": "Creates a folding range from the current selection in the editor."
  },
  {
    "commandId": "editor.removeManualFoldingRanges",
    "desc": "Removes all manually created folding ranges in the editor."
  },
  {
    "commandId": "editor.action.rename",
    "desc": "Triggers the rename action for the selected symbol in the editor, allowing the user to rename the symbol and automatically update all references to it within the scope."
  },
  {
    "commandId": "workbench.action.replaceInFiles",
    "desc": "Opens the global search interface with the replace option enabled to perform text replacement across multiple files."
  },
  {
    "commandId": "workbench.action.toggleLockedScrolling",
    "desc": "Toggles locked scrolling, allowing the editor to scroll beyond the last line of the file."
  },
  {
    "commandId": "editor.action.startFindReplaceAction",
    "desc": "Opens the Find and Replace panel in the active editor."
  },
  {
    "commandId": "workbench.action.splitEditor",
    "desc": "Splits the currently active editor into two, either side by side or stacked vertically."
  },
  {
    "commandId": "workbench.action.splitEditorOrthogonal",
    "desc": "Splits the active editor group into two groups orthogonally."
  },
  {
    "commandId": "workbench.action.splitEditorLeft",
    "desc": "Splits the active editor group and moves the editor into the new group on the left side."
  },
  {
    "commandId": "workbench.action.splitEditorRight",
    "desc": "Splits the currently active editor into two, placing the new editor group to the right of the current one."
  },
  {
    "commandId": "workbench.action.splitEditorUp",
    "desc": "Splits the currently active editor into two, placing the new editor group above the current one."
  },
  {
    "commandId": "workbench.action.splitEditorDown",
    "desc": "Splits the currently active editor into two, placing the new editor group below the current one."
  },
  {
    "commandId": "editor.action.trimTrailingWhitespace",
    "desc": "Trims trailing whitespace from the current file."
  }
]