[
  {
    "id": "terminal.integrated.tabs.hideCondition",
    "desc": " Controls whether the terminal tabs view will hide under certain conditions.\n  - never: Never hide the terminal tabs view\n  - singleTerminal: Hide the terminal tabs view when there is only a single terminal opened\n  - singleGroup: Hide the terminal tabs view when there is only a single terminal group opened",
    "example": {
      "terminal.integrated.tabs.hideCondition": "singleTerminal"
    }
  },
  {
    "id": "terminal.integrated.tabs.location",
    "desc": " Controls the location of the terminal tabs, either to the left or right of the actual terminal(s).\n  - left: Show the terminal tabs view to the left of the terminal\n  - right: Show the terminal tabs view to the right of the terminal",
    "example": {
      "terminal.integrated.tabs.location": "right"
    }
  },
  {
    "id": "terminal.integrated.tabs.title",
    "desc": " Controls the terminal title. Variables are substituted based on the context:\n - `${cwd}`: the terminal's current working directory\n - `${cwdFolder}`: the terminal's current working directory, displayed for multi-root workspaces or in a single root workspace when the value differs from the initial working directory. On Windows, this will only be displayed when shell integration is enabled.\n - `${workspaceFolder}`: the workspace in which the terminal was launched\n - `${local}`: indicates a local terminal in a remote workspace\n - `${process}`: the name of the terminal process\n - `${separator}`: a conditional separator (` - `) that only shows when surrounded by variables with values or static text.\n - `${sequence}`: the name provided to the terminal by the process\n - `${task}`: indicates this terminal is associated with a task",
    "example": {
      "terminal.integrated.tabs.title": "${process}"
    }
  },
  {
    "id": "terminal.integrated.tabs.enableAnimation",
    "desc": " Controls whether terminal tab statuses support animation (eg. in progress tasks).",
    "example": {
      "terminal.integrated.tabs.enableAnimation": true
    }
  }
]